# Import and Export : MySQL - Python

## MySQL - Import

In [ ]:
#pip install pymysql
#!pip install mysqlclient

In [ ]:
#libraries
import pandas as pd
import pymysql
from sqlalchemy import create_engine
import os

In [ ]:
print(pymysql.__version__)

In [ ]:
F1 = '/Users/du/dup/analytics/data/'
print(sorted(os.listdir(F1)))

In [ ]:
folder1 = '/Users/du/dup/analytics/data/'
file1 = "students1.csv"

# Join folder and file name
file_path = os.path.join(folder1, file1)

if os.path.isfile(file_path):
    print(f"✅ File exists: {file_path}")
else:
    print(f"❌ File not found in {folder_path}")

In [ ]:
print(file_path)

In [ ]:
df = pd.read_csv(file_path)
df.shape

In [ ]:
df.head()

In [ ]:
df.dtypes  # dates type NA

In [ ]:
df['exam_date'] = pd. to_datetime(df['exam_date'], dayfirst=False, errors='coerce')
df.dtypes

In [ ]:
#user-piuser, pwd-Pass#123, yourdb - students
#engine = create_engine('mysql+pymysql://piuser:Pass#123@localhost:3306/piit')
engine1 = create_engine("mysql+pymysql://piuser:Pass%40123@localhost:3306/piit")
engine1

In [70]:
conn = engine1.connect()
print(conn)

<sqlalchemy.engine.base.Connection object at 0x30974c8c0>

In [71]:
pd.read_sql('SHOW DATABASES;', engine1)

             Database
0          GSTBILLING
1  information_schema
2               mysql
3  performance_schema
4                piit
5                 sys

In [72]:
pd.read_sql('SHOW TABLES;', engine1)

       Tables_in_piit
0           employees
1         math_scores
2               sales
3      student_scores
4      student_totals
5            students
6  subject_avg_scores

In [73]:
df.to_sql('students', engine1, if_exists='append', index=False, chunksize=1000, method='multi')

30

In [ ]:
 # Students from csv imported in mysql database as students table

## Export from MySQL to csv/excel

In [ ]:
# libraries
import pandas as pd
import pymysql
from sqlalchemy import create_engine
import os

In [ ]:
# Engine - piuser#123
engine1 = create_engine("mysql+pymysql://piuser:Pass%40123@localhost:3306/piit")
engine1

In [74]:
df2 = pd.read_sql("SELECT * FROM employees", engine1)
df2.shape

(10, 5)

In [75]:
df2.head(2)

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  50000.0
1            2       Jane     Smith         IT  60000.0

In [76]:
df3 = df2.copy()
df3.head()

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  50000.0
1            2       Jane     Smith         IT  60000.0
2            3      Alice   Johnson    Finance  55000.0
3            4        Bob  Williams         IT  62000.0
4            5      Emily     Brown         HR  48000.0

In [77]:
df3['employee_id'] = df3['employee_id'] + 100
df3

   employee_id first_name last_name department   salary
0          101       John       Doe         HR  50000.0
1          102       Jane     Smith         IT  60000.0
2          103      Alice   Johnson    Finance  55000.0
3          104        Bob  Williams         IT  62000.0
4          105      Emily     Brown         HR  48000.0
5          201       John       Doe         HR  50000.0
6          202       Jane     Smith         IT  60000.0
7          203      Alice   Johnson    Finance  55000.0
8          204        Bob  Williams         IT  62000.0
9          205      Emily     Brown         HR  48000.0

In [ ]:
df3.to_sql(  name='employees', con=engine1, if_exists='append', index=False )
## options: 'fail', 'replace', 'append'

In [78]:
df4 = pd.read_sql("SELECT * FROM employees", engine1)
df4

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  50000.0
1            2       Jane     Smith         IT  60000.0
2            3      Alice   Johnson    Finance  55000.0
3            4        Bob  Williams         IT  62000.0
4            5      Emily     Brown         HR  48000.0
5          101       John       Doe         HR  50000.0
6          102       Jane     Smith         IT  60000.0
7          103      Alice   Johnson    Finance  55000.0
8          104        Bob  Williams         IT  62000.0
9          105      Emily     Brown         HR  48000.0

In [ ]:
csvfile = '/Users/du/dup/analytics/data/employees1.csv'
xlsfile =  '/Users/du/dup/analytics/data/employees2.xlsx'

In [ ]:
print(os.listdir('/Users/du/dup/analytics/data'))

In [ ]:
df2.to_csv(csvfile, index=False)

In [ ]:
df2.to_excel(xlsfile, index=False)

In [ ]:
print(sorted(os.listdir('/Users/du/dup/analytics/data'), key=str.lower))

In [ ]:
# import data and check
df2b = pd.read_csv(csvfile)
df2b.shape

In [ ]:
df2c = pd.read_excel(xlsfile)
df2c.shape

In [ ]:
# select any df
df2b

In [ ]:
df4 = df2b.copy()
df4

In [ ]:
df4['employee_id'] = df4['employee_id'] +100

In [ ]:
df4

In [ ]:
# Write from CSV to MYSQL

In [ ]:
df4.to_sql(  name='employees',    con=engine1,   if_exists='append',   # options: 'fail', 'replace', 'append'
    index=False )

In [ ]:
df5 = pd.read_sql("SELECT * FROM employees", engine1)
df5

In [ ]:
#Done